whatnick/FRDM-K82F_WS2812_Driver_v13/SDK/platform/system/src/clock/MK82F25615/fsl_clock_MK82F25615.c
    SIM_HAL_DisableClock(SIM, emvsimGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetEmvsimGateCmd
 * Description   : Get the the clock gate state for EMVSIM module
 * This function will get the clock gate state for EMVSIM moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetEmvsimGateCmd(uint32_t instance)
{
    assert(instance < sizeof(emvsimGateTable)/sizeof(emvsimGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, emvsimGateTable[instance]);
}


/* TPM instance table. */
static const sim_clock_gate_name_t tpmGateTable[] =
{
    kSimClockGateTpm1,
    kSimClockGateTpm2
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableTpmClock
 * Description   : Enable the clock for TPM module
 * This function enables the clock for TPM moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableTpmClock(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    SIM_HAL_EnableClock(SIM, tpmGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableTpmClock
 * Description   : Disable the clock for TPM module
 * This function disables the clock for TPM moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableTpmClock(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    SIM_HAL_DisableClock(SIM, tpmGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetTpmGateCmd
 * Description   : Get the the clock gate state for TPM module
 * This function will get the clock gate state for TPM moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetTpmGateCmd(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, tpmGateTable[instance]);
}

/* Lptmr instance table. */
static const sim_clock_gate_name_t lptmrGateTable[] =
{
    kSimClockGateLptmr0,
    kSimClockGateLptmr1
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableLptmrClock
 * Description   : Enable the clock for LPTMR module
 * This function enables the clock for LPTMR moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableLptmrClock(uint32_t instance)
{
    assert(instance < sizeof(lptmrGateTable)/sizeof(lptmrGateTable[0]));

    SIM_HAL_EnableClock(SIM, lptmrGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableLptmrClock
 * Description   : Disable the clock for LPTMR module
 * This function enables the clock for LPTMR moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableLptmrClock(uint32_t instance)
{
    assert(instance < sizeof(lptmrGateTable)/sizeof(lptmrGateTable[0]));

    SIM_HAL_DisableClock(SIM, lptmrGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetLptmrGateCmd
 * Description   : Get the the clock gate state for LPTMR module
 * This function will get the clock gate state for LPTMR moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetLptmrGateCmd(uint32_t instance)
{
    assert(instance < sizeof(lptmrGateTable)/sizeof(lptmrGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, lptmrGateTable[instance]);
}

/* Ltc instance table. */
static const sim_clock_gate_name_t ltcGateTable[] =
{
    kSimClockGateLtc0
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableLtcClock
 * Description   : Enable the clock for LTC module
 * This function enables the clock for LTC moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableLtcClock(uint32_t instance)
{
    assert(instance < sizeof(ltcGateTable)/sizeof(ltcGateTable[0]));

    SIM_HAL_EnableClock(SIM, ltcGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableLtcClock
 * Description   : Disable the clock for LTC module
 * This function enables the clock for LTC moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableLtcClock(uint32_t instance)
{
    assert(instance < sizeof(ltcGateTable)/sizeof(ltcGateTable[0]));

    SIM_HAL_DisableClock(SIM, ltcGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetLtcGateCmd
 * Description   : Get the the clock gate state for LTC module
 * This function will get the clock gate state for LTC moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetLtcGateCmd(uint32_t instance)
{
    assert(instance < sizeof(ltcGateTable)/sizeof(ltcGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, ltcGateTable[instance]);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
